Revit 2026 API

# FilterNumericGreaterOrEqual Properties

---

The FilterNumericGreaterOrEqual type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterNumericRuleEvaluator) |

#### Reference

FilterNumericGreaterOrEqual Class

Autodesk.Revit.DB Namespace